TZlindra/ELEC291Project2/EFM8/Robot/ParseTest.c
#include <EFM8LB1.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <ctype.h>

#define SYSCLK 72000000
#define BAUDRATE 115200L

idata char buff[80];

void splitString(const char *str, char **part1, char **part2);
int stringToInt(char *str);

char _c51_external_startup (void)
{
	// Disable Watchdog with key sequence
	SFRPAGE = 0x00;
	WDTCN = 0xDE; //First key
	WDTCN = 0xAD; //Second key

	VDM0CN=0x80;       // enable VDD monitor
	RSTSRC=0x02|0x04;  // Enable reset on missing clock detector and VDD

	#if (SYSCLK == 48000000L)
		SFRPAGE = 0x10;
		PFE0CN  = 0x10; // SYSCLK < 50 MHz.
		SFRPAGE = 0x00;
	#elif (SYSCLK == 72000000L)
		SFRPAGE = 0x10;
		PFE0CN  = 0x20; // SYSCLK < 75 MHz.
		SFRPAGE = 0x00;
	#endif

	#if (SYSCLK == 12250000L)
		CLKSEL = 0x10;
		CLKSEL = 0x10;
		while ((CLKSEL & 0x80) == 0);
	#elif (SYSCLK == 24500000L)
		CLKSEL = 0x00;
		CLKSEL = 0x00;
		while ((CLKSEL & 0x80) == 0);
	#elif (SYSCLK == 48000000L)
		// Before setting clock to 48 MHz, must transition to 24.5 MHz first
		CLKSEL = 0x00;
		CLKSEL = 0x00;
		while ((CLKSEL & 0x80) == 0);
		CLKSEL = 0x07;
		CLKSEL = 0x07;
		while ((CLKSEL & 0x80) == 0);
	#elif (SYSCLK == 72000000L)
		// Before setting clock to 72 MHz, must transition to 24.5 MHz first
		CLKSEL = 0x00;
		CLKSEL = 0x00;
		while ((CLKSEL & 0x80) == 0);
		CLKSEL = 0x03;
		CLKSEL = 0x03;
		while ((CLKSEL & 0x80) == 0);
	#else
		#error SYSCLK must be either 12250000L, 24500000L, 48000000L, or 72000000L
	#endif

	P0MDOUT |= 0x11; // Enable UART0 TX (P0.4) and UART1 TX (P0.0) as push-pull outputs
	P2MDOUT |= 0x01; // P2.0 in push-pull mode
	XBR0     = 0x01; // Enable UART0 on P0.4(TX) and P0.5(RX)
	XBR1     = 0X00;
	XBR2     = 0x41; // Enable crossbar and uart 1

	// Configure Uart 0
	#if (((SYSCLK/BAUDRATE)/(2L*12L))>0xFFL)
		#error Timer 0 reload value is incorrect because (SYSCLK/BAUDRATE)/(2L*12L) > 0xFF
	#endif
	SCON0 = 0x10;
	TH1 = 0x100-((SYSCLK/BAUDRATE)/(2L*12L));
	TL1 = TH1;      // Init Timer1
	TMOD &= ~0xf0;  // TMOD: timer 1 in 8-bit auto-reload
	TMOD |=  0x20;
	TR1 = 1; // START Timer1
	TI = 1;  // Indicate TX0 ready

	return 0;
}

// Uses Timer3 to delay <us> micro-seconds.
void Timer3us(unsigned char us)
{
	unsigned char i;               // usec counter

	// The input for Timer 3 is selected as SYSCLK by setting T3ML (bit 6) of CKCON0:
	CKCON0|=0b_0100_0000;

	TMR3RL = (-(SYSCLK)/1000000L); // Set Timer3 to overflow in 1us.
	TMR3 = TMR3RL;                 // Initialize Timer3 for first overflow

	TMR3CN0 = 0x04;                 // Sart Timer3 and clear overflow flag
	for (i = 0; i < us; i++)       // Count <us> overflows
	{
		while (!(TMR3CN0 & 0x80));  // Wait for overflow
		TMR3CN0 &= ~(0x80);         // Clear overflow indicator
	}
	TMR3CN0 = 0 ;                   // Stop Timer3 and clear overflow flag
}

void waitms (unsigned int ms)
{
	unsigned int j;
	unsigned char k;
	for(j=0; j<ms; j++)
		for (k=0; k<4; k++) Timer3us(250);
}

void UART1_Init(unsigned long baudrate) {
    SFRPAGE = 0x20;
    SMOD1 = 0x0C; // no parity, 8 data bits, 1 stop bit
    SCON1 = 0x10; // Mode 1, 8-bit UART, variable baud rate, receive enabled
    SBCON1 = 0x00; // disable baud rate generator
    SBRL1 = 0x10000L - ((SYSCLK / baudrate) / (12L * 2L));
    TI1 = 1; // indicate ready for TX
    SBCON1 |= 0x40; // enable baud rate generator
    SFRPAGE = 0x00;
}

void putchar1(char c) {
    SFRPAGE = 0x20;
    while (!TI1);
    TI1 = 0;
    SBUF1 = c;
    SFRPAGE = 0x00;
}

void sendstr1 (char * s)
{
	while(*s)
	{
		putchar1(*s);
		s++;
	}
}

char getchar1(void) {
    char c;
    SFRPAGE = 0x20;
    while (!RI1);
    RI1 = 0;
    // Clear Overrun and Parity error flags
    SCON1 &= 0b_0011_1111;
    c = SBUF1;
    SFRPAGE = 0x00;
    return (c);
}

char getchar1_with_timeout (void)
{
	char c;
	unsigned int timeout;
    SFRPAGE = 0x20;
    timeout=0;
	while (!RI1)
	{
		SFRPAGE = 0x00;
		Timer3us(20);
		SFRPAGE = 0x20;
		timeout++;
		if(timeout==25000)
		{
			SFRPAGE = 0x00;
			return ('\n'); // Timeout after half second
		}
	}
	RI1=0;
	// Clear Overrun and Parity error flags
	SCON1&=0b_0011_1111;
	c = SBUF1;
	SFRPAGE = 0x00;
	return (c);
}

void getstr1 (char * s)
{
	char c;

	while(1)
	{
		c=getchar1_with_timeout();
		if(c=='\n')
		{
			*s=0;
			return;
		}
		*s=c;
		s++;
	}
}

// RXU1 returns '1' if there is a byte available in the receive buffer of UART1
bit RXU1 (void)
{
	bit mybit;
    SFRPAGE = 0x20;
	mybit=RI1;
	SFRPAGE = 0x00;
	return mybit;
}

void waitms_or_RI1 (unsigned int ms)
{
	unsigned int j;
	unsigned char k;
	for(j=0; j<ms; j++)
	{
		for (k=0; k<4; k++)
		{
			if(RXU1()) return;
			Timer3us(250);
		}
	}
}

void SendATCommand (char * s)
{
	printf("Command: %s", s);
	P2_0=0; // 'set' pin to 0 is 'AT' mode.
	waitms(5);
	sendstr1(s);
	getstr1(buff);
	waitms(10);
	P2_0=1; // 'set' pin to 1 is normal operation mode.
	printf("Response: %s\r\n", buff);
}


void JDYInit(void) {
	SendATCommand("AT+DVIDAFAF\r\n");
	SendATCommand("AT+RFIDFFBB\r\n");
	// To check configuration
	SendATCommand("AT+VER\r\n");
	SendATCommand("AT+BAUD\r\n");
	SendATCommand("AT+RFID\r\n");
	SendATCommand("AT+DVID\r\n");
	SendATCommand("AT+RFC\r\n");
	SendATCommand("AT+POWE\r\n");
	SendATCommand("AT+CLSS\r\n");
}

void Trim(char *str, int *xin, int *yin) {
    int i,j;
    char *x,*y;
    for (i = 0, j = 0; str[i] != '\0'; i++) {
        if (isdigit(str[i])|| str[i] == '-') {
            str[j++] = str[i];
        }
    }
    str[j] = '\0';  // Null-terminate the resulting string
    printf("Test1: %s \r\n",str);
    splitString(str,&x,&y);
    *xin = stringToInt(x);
    *yin = stringToInt(y);
}

void clearUART1Buffer(void) {
    // Disable UART1 reception
    REN1 = 0;  // Disable UART1 reception

    // Flush the receive buffer
    while (RI1) {
        volatile dummy = SBUF1; // Read and discard data from receive buffer
    }

    // Re-enable UART1 reception
    REN1 = 1;  // Enable UART1 reception
}

int stringToInt(char *str) {
    int result = 0;
    int sign = 1;
    int i = 0;

    // Check for negative sign
    if (str[0] == '-') {
        sign = -1;
        i++;
    }

    // Iterate through characters of the string
    for (; str[i] != '\0'; ++i) {
        if (str[i] >= '0' && str[i] <= '9') {
            // Convert character to integer and add to result
            result = result * 10 + (str[i] - '0');
        } else {
            // If non-numeric character encountered, return 0
            return 0;
        }
    }

    // Apply sign
    return sign * result;
}

void splitString(const char *str, char **part1, char **part2) {
    int len = strlen(str);

    // Check if the string length is less than 3
    if (len < 3) {
        *part1 = malloc((len + 1) * sizeof(char)); // Include space for null terminator
        strcpy(*part1, str);
        *part2 = NULL;
        return;
    }

    // Allocate memory for part1 and part2
    *part1 = malloc(4 * sizeof(char));  // Include space for null terminator
    *part2 = malloc((len - 2 + 1) * sizeof(char));  // Include space for null terminator

    // Copy characters up to the third index (excluding)
    strncpy(*part1, str, 3);
    (*part1)[3] = '\0';  // Null terminate part1

    // Copy remaining characters to part2
    strncpy(*part2, str + 3,3);
    (*part2)[6] = '\0';
}


void main (void)
{
	unsigned int cnt;
	int length;
	int commands[2];
	waitms(500);
	printf("\r\nJDY-40 test\r\n");
	UART1_Init(9600);

	// To configure the device (shown here using default values).
	// For some changes to take effect, the JDY-40 needs to be power cycled.
	// Communication can only happen between devices with the
	// same RFID and DVID in the same channel.

	//SendATCommand("AT+BAUD4\r\n");
	//SendATCommand("AT+RFID8899\r\n");
	//SendATCommand("AT+DVID1122\r\n"); // Default device ID.
	//SendATCommand("AT+RFC001\r\n");
	//SendATCommand("AT+POWE9\r\n");
	//SendATCommand("AT+CLSSA0\r\n");

	// We should select an unique device ID.  The device ID can be a hex
	// number from 0x0000 to 0xFFFF.  In this case is set to 0xABBA
	SendATCommand("AT+DVIDAFAF\r\n");
	SendATCommand("AT+RFIDFFBB\r\n");
	// To check configuration
	SendATCommand("AT+VER\r\n");
	SendATCommand("AT+BAUD\r\n");
	SendATCommand("AT+RFID\r\n");
	SendATCommand("AT+DVID\r\n");
	SendATCommand("AT+RFC\r\n");
	SendATCommand("AT+POWE\r\n");
	SendATCommand("AT+CLSS\r\n");

	printf("\r\Press and hold the BOOT button to transmit.\r\n");

	cnt=0;
	while(1)
	{
		if(P3_7==0)
		{
			sprintf(buff, " %d\r\n", cnt++);
			sendstr1(buff);
			clearUART1Buffer();
			putchar('.');
			waitms_or_RI1(200);
		}
		if(RXU1())
		{

			getstr1(buff);
			clearUART1Buffer();
			length = strlen(buff);
			Trim(buff, &commands[0],&commands[1]);
			if(length >= 11){
			//	printf("X: %d \r\n", commands[0]);
			//	printf("Y: %d \r\n", commands[1]);
			}
			else{
				printf("test\r\n");
			}
		}
	}
}
